const mongoose = require("mongoose");
const Tour = require("./models/Tour"); // გზა შეცვალე საჭიროებისამებრ

// MongoDB კავშირის სტრინგი
const MONGO_URI = "mongodb+srv://zuberidze1997_db_user:7RGVCLnl5YlrQPDY@cluster0.lnhjbq4.mongodb.net/?retryWrites=true&w=majority&appName=Cluster0"; // შეცვალე

mongoose.connect(MONGO_URI)
  .then(() => console.log("MongoDB connected"))
  .catch((err) => console.log(err));

// სურათები შეგიძლია გამოიყენო URL-ის სახით ან placeholder
const tours = [
    {
    id: 1,
    head: "დასავლეთ და აღმოსავლეთ ევროპის შედევრები",
    img: "https://via.placeholder.com/800x500?text=Vienna+Tour",
    includes:
        "მილანი - ლუბლიანა - (ზაგრები) - ბუდაპეშტი - ვენა - პრაღა - (დრეზდენი) - (კარლშტეინი და კონოპისტე) - ინსბურკი - (ზალცბურგი) - ვენეცია - მილანი",
    details: {
        day: [
        {
            id: 1,
            head: "1 დღე. მილანი",
            paragraph:
            "ჩაფრენა მილანში. აეროპორტში კომპანიის წარმომადგენელთან შეხვედრა, რომელსაც ხელში ეჭირება წარწერა Europe Voyage. ტრანსფერი და სასტუმროში განთავსება. თავისუფალი დრო. ღამისთევა სასტუმროში.",
        },
        {
            id: 2,
            head: "2 დღე. მილანი",
            paragraph:
            "საუზმე სასტუმროში. თავისუფალი დღე. ღამე სასტუმროში.",
        },
        {
            id: 3,
            head: "3 დღე. მილანი",
            paragraph:
            "საუზმე სასტუმროში. შეხვედრა თანმხლებ ჯგუფთან. მილანის მიმოხილვითი საფეხმალო ტური, რუსულენოვან გამყოლთან ერთად, რომელიც მოიცავს ქალაქის ცენტრალური ნაწილის გაცნობას...",
        },
        {
            id: 4,
            head: "4 დღე. ლუბლიანა",
            paragraph:
            "საუზმე სასტუმროში. ტრანსფერი ლუბლიანაში. ქალაქის ტური...",
        },
        {
            id: 5,
            head: "5 დღე. ზაგრები",
            paragraph:
            "საუზმე სასტუმროში. სურვილისამებრ შესაძლებელია დღიური სრული ექსკურსიის მოწყობა ხორვატიაში...",
        },
        {
            id: 6,
            head: "6 დღე. ბუდაპეშტი",
            paragraph:
            "საუზმე სასტუმროში. ბუდაპეშტში გადასვლა. ბუდაპეშტის ღირსშესანიშნაობების დათვალიერება...",
        },
        {
            id: 7,
            head: "7 დღე. ვენა",
            paragraph:
            "საუზმე სასტუმროში. გადაადგილება ვენაში. ქალაქის ისტორიული ცენტრის დათვალიერება...",
        },
        {
            id: 8,
            head: "8 დღე. პრაღა",
            paragraph:
            "საუზმე სასტუმროში. პრაღაში გადასვლა. პრაღის ისტორიული ცენტრის ღირსშესანიშნაობების დათვალიერება...",
        },
        {
            id: 9,
            head: "9 დღე. დრეზდენი",
            paragraph:
            "საუზმე სასტუმროში. თავისუფალი დღე პრაღაში ან სურვილისამებრ ექსკურსია ქალაქ დრეზდენში...",
        },
        {
            id: 10,
            head: "10 დღე. კარლშტეინი და კონოპისტე",
            paragraph:
            "საუზმე სასტუმროში. სურვილისამებრ ექსკურსია შუა საუკუნეების ციხეებში...",
        },
        {
            id: 11,
            head: "11 დღე. ზალცბურგი და ინსბურკი",
            paragraph:
            "საუზმე სასტუმროში. ინსბურკში გადასვლა. გზად შესაძლებელია ექსკურსია ზალცბურგში...",
        },
        {
            id: 12,
            head: "12 დღე. ვენეცია-მილანი",
            paragraph:
            "საუზმე სასტუმროში. გადაადგილება ვენეციაში, ქალაქის ღირსშესანიშნაობების დათვალიერება...",
        },
        {
            id: 13,
            head: "13 დღე. მილანი",
            paragraph:
            "საუზმე სასტუმროში. ჯგუფური ტრანსფერი აეროპორტში.",
        },
        ],
        inPrice: [
        "დილის საუზმე",
        "სასტუმროში განთავსება",
        "ჯგუფური ტრანსფერი აეროპორტი-სასტუმრო-აეროპორტი",
        "ტრანსპორტირება კომფორტული ავტობუსით, რუსულენოვან გამყოლთან ერთად",
        "ექსკურსიები რუსულენოვანი ლიცენზირებული მეგზურით: რომი, ლუბლიანა, ბუდაპეშტი, ვენა, პრაღა, ვენეცია",
        ],
        additionTours: [
        "მუზეუმში შესასვლელი ბილეთები",
        "ექსკურსია ზაგრებში (ხორვატია) 65 ევრო",
        "ექსკურსია ლა-სკალაში - 30 ევრო (შესასვლელი ბილეთი შედის საფასურში)",
        "ექსკურსია დუომოს საკათედრო ტაძარში - 25 ევრო",
        "ტბა მაჟორეზე გასეირნება ნავით - 55 ევრო",
        "ისოლა ბელა - ბოტანიკური ბაღი - 20 ევრო (შესასვლელი ბილეთი შედის საფასურში)",
        "ექსკურსია ჰოფბურგის სასახლეში 35 ევრო + ბილეთი",
        "ექსკურსია ღამის ვენაში 35 ევრო",
        "ექსკურსია დრეზდენში 65 ევრო",
        "ექსკურსია დრეზდენის გალერეაში 28 ევრო + ბილეთი",
        "ექსკურსია კარლშტეინისა და კონოპისტეს ციხეებში 50 ევრო + ბილეთი",
        "ზალცბურგში გაჩერება ქალაქის ტურით 25 ევრო",
        "ზალცბურგში გაჩერება ექსკურსიის გარეშე 15 ევრო",
        ],
        mustPay: [
        "ყურსასმენები მთელი ტურის განმავლობაში",
        "სასტუმროს გადასახადი (city tax) 1-დან 3.5 ევრომდე დღეში ერთ ადამიანზე",
        "Grand Canal ვენეციაში 30 ევრო ან Giudecca Canal 20 ევრო",
        ],
    },
    },
    {
    id: 2,
    head: "გრანდ ტური ევროპაში",
    img: "https://via.placeholder.com/800x500?text=Vienna+Tour",
    includes:
        "მილანი - (ბერგამო) - სტრასბურგი - პარიზი - ბრიუსელი - ამსტარედამი - (ჰააგა) (ვოლენდამი) - მაინის ფრანკფურტი - მიუნჰენი - ვერონა - (ვენეცია)- ვენეტოს რეგიონი - (პადუია) - მილანი",
    details: {
        day: [
        {
            id: 1,
            head: "1 დღე. მილანი",
            paragraph:
            "აეროპორტში კომპანიის წარმომადგენელთან შეხვედრა, რომელსაც ხელში ეჭირება წარწერა Europe Voyage. განთავსება სასტუმროში. თავისუფალი დრო. ღამისთევა სასტუმროში.",
        },
        {
            id: 2,
            head: "2 დღე. მილანი",
            paragraph:
            "საუზმე სასტუმროში. ღირსშესანიშნაობების საფეხმავლო ტური რუსულენოვან გიდთან ერთად მილანის ისტორიულ ცენტრში...",
        },
        {
            id: 3,
            head: "3 დღე. სტრასბურგი",
            paragraph:
            "საუზმე სასტუმროში. გადასვლა სტრასბურგში. ქალაქის დათვალიერება და სასტუმროში განთავსება.",
        },
        {
            id: 4,
            head: "4 დღე. პარიზი",
            paragraph:
            "საუზმე სასტუმროში. გადასვლა პარიზში. ავტობუსით მიმოხილვითი ექსკურსია...",
        },
        {
            id: 5,
            head: "5 დღე. პარიზი",
            paragraph:
            "საუზმე სასტუმროში. თავისუფალი დღე ან სურვილისამებრ ექსკურსიები.",
        },
        {
            id: 6,
            head: "6 დღე. ბრიუსელი",
            paragraph:
            "საუზმე სასტუმროში. გადასვლა ბრიუსელში. ქალაქის მიმოხილვითი ტური.",
        },
        {
            id: 7,
            head: "7 დღე. ამსტერდამი",
            paragraph:
            "საუზმე სასტუმროში. მიმოხილვითი ექსკურსია ამსტერდამის არხებზე. სურვილისამებრ ექსკურსია ჰააგაში.",
        },
        {
            id: 8,
            head: "8 დღე. (ვოლენდამი - ზაანსე სჰანსი)",
            paragraph:
            "საუზმე სასტუმროში. სურვილისამებრ ექსკურსია ვოლენდამში და ზაანსე სჰანსში. გადfahrt მაინის ფრანკფურტში.",
        },
        {
            id: 9,
            head: "9 დღე. მაინის ფრანკფურტი - მიუნჰენი",
            paragraph:
            "საუზმე სასტუმროში. დათვალიერება და გადასვლა მიუნჰენში. ღამისთევა სასტუმროში.",
        },
        {
            id: 10,
            head: "10 დღე. ნოიშვანშტაინის ციხე - ვერონა",
            paragraph:
            "საუზმე სასტუმროში. სურვილისამებრ ექსკურსია ნოიშვანშტაინის ციხეში. ვერონაში გადასვლა.",
        },
        {
            id: 11,
            head: "11 დღე. ვერონა - (ვენეცია)",
            paragraph:
            "საუზმე სასტუმროში. სურვილისამებრ ექსკურსია ვენეციაში. ტრანსფერი მილანში.",
        },
        {
            id: 12,
            head: "12 დღე. მილანი - პადუია",
            paragraph:
            "საუზმე სასტუმროში. სურვილისამებრ ექსკურსია პადუიაში. საღამოს დაბრუნება მილანში.",
        },
        {
            id: 13,
            head: "13 დღე. მილანი",
            paragraph: "საუზმე სასტუმროში. აეროპორტში ტრანსფერი.",
        },
        ],
        inPrice: [
        "3* სასტუმროში განთავსება და დილის საუზმე",
        "აეროპორტი-სასტუმრო-აეროპორტი ჯგუფური ტრანსფერი მალპენსას აეროპორტის ყველა რეისისათვის",
        "ტრანსპორტით უზრუნველყოფა რუსულენოვანი ასისტენტის თანხლებით",
        "ექსკურსიები რუსულენოვანი ლიცენზირებული მეგზურით: პარიზი, ბრიუსელი, ამსტერდამი, მილანი",
        "მაინის ფრანფურტი და მიუნჰენის მონახულება რუსულენოვანი ასისტენტის თანხლებით",
        ],
        additionTours: [
        "მუზეუმში შესასვლელი ბილეთები",
        "ლა-სკალას მუზეუმი - 30 ევრო",
        "დუომოს ტაძარი მილანში - 25 ევრო",
        "მაჟორის ტბაზე გასეირნება - 55 ევრო",
        "ლუცერნის მონახულება - 10 ევრო",
        "სტრასბურგის ექსკურსია - 10 ევრო",
        "ნოტრ-დამისა და ლათინური კვარტლის ექსკურსია - 35 ევრო",
        "მონმარტრი - 35 ევრო",
        "ლუვრი მეგზურთან - 45 ევრო + ბილეთი 20 ევრო",
        "ვერსალი - 55 ევრო + ბილეთი 18 ევრო",
        "სენაზე ნავით გასეირნება - 15 ევრო",
        "მულენ-რუჟის შოუ (ღირებულება ცვალებადი)",
        "ჰააგა - 40 ევრო",
        "ვოლენდამი + ზაანსე სჰანსი - 65 ევრო",
        "ნოიშვანშტაინის ციხე - 55 ევრო + ბილეთი 16 ევრო",
        "ინსბრუკის მონახულება - 10 ევრო",
        "ვენეციის ექსკურსია - 60 ევრო",
        "ვენეციის დიდი არხი - 20 ევრო",
        "წმინდა მარკოს ტაძარი - 15 ევრო",
        "წმინდა ლაზარეს კუნძული - 35 ევრო",
        "პადუია - 35 ევრო",
        ],
        mustPay: [
        "ყურსასმენებით სარგებლობა მთელი ტურის განმავლობაში - 20 ევრო",
        "ნავით გასეირნება ამსტერდამის არხებზე - 10 ევრო",
        "ტურისტული გადასახადი სასტუმროში (City Tax)",
        "გადასახადი ამსტერდამში შესასვლელად - 1.5–3 ევრო ერთ ადამიანზე",
        ],
    },
    },
    {
    id: 3,
    head: 'კლასიკური იტალია + ზღვა',
    img: "https://via.placeholder.com/800x500?text=Vienna+Tour",
    includes: 'რომი - (ნაპოლი,, პომპეი) - (პიზა) - მონტეკატინი - ტერმე - (სიენა-სან ჯიმინიანო) - ფლორენცია - ვენეტოს რეგიონი - ვენეცია - რომი - ზღვაზე დასვენება',
    details: {
        day: [
        {
            id: 1,
            head: '1 დღე.',
            paragraph: 'ჩაფრენა რომში. აეროპორტში შეხვედრა კომპანიის წარმომადგენელთან წარწერით Europe Voyage. ტრანსფერი და განთავსება სასტუმროში. თავისუფალი დრო. სურვილისამებრ დაორგანიზდება ექსკურსია "ღამის რომში". ღამისთევა სასტუმროში.'
        },
        {
            id: 2,
            head: '2 დღე. რომი (ნეაპოლი-პომპეი)',
            paragraph: 'საუზმე სასტუმროში. თავისუფალი დრო. სურვილისამებრ ჩატარდება დამატებითი ექსკურსია ნეაპოლი-პომპეი (სრული დღე)... დაბრუნება და ღამისთევა რომში.'
        },
        {
            id: 3,
            head: '3 დღე. რომი - პიზა',
            paragraph: 'საუზმე სასტუმროში. ვატიკანის მუზეუმის ტური რუსულენოვანი მეგზურით... ღამისთევა მონტეკატინი-ტერმეს მიმდებარედ.'
        },
        {
            id: 4,
            head: '4 დღე. ფლორენცია (სიენა - სან ჯიმინიანო)',
            paragraph: 'საუზმე სასტუმროში... დაბრუნება სასტუმროში მონტეკატინი-ტერმეს მიმდებარედ. ღამისთევა სასტუმროში.'
        },
        {
            id: 5,
            head: '5 დღე. ფლორენცია - ვენეტოს რეგიონი',
            paragraph: 'საუზმე სასტუმროში... განთავსება ვენეტოს რეგიონში მდებარე სასტუმროში და ღამისთევა.'
        },
        {
            id: 6,
            head: '6 დღე. ვენეცია',
            paragraph: 'საუზმე სასტუმროში. გამგზავრება ვენეციაში... ღამისთევა ვენეციის ან რომის სასტუმროში.'
        },
        {
            id: 7,
            head: '7 დღე. ვენეტოს რეგიონი',
            paragraph: 'საუზმე სასტუმროში. გამგზავრება რომში. თავისუფალი დრო. ღამისთევა სასტუმროში.'
        },
        {
            id: 8,
            head: '8 დღე. რომი',
            paragraph: 'საუზმე სასტუმროში. გადასვლა რომის მიმდებარე ტერიტორიაზე - ტირენიის ზღვა. განთავსება სასტუმროში. ღამისთევა სასტუმროში.'
        },
        {
            id: 9,
            head: '9 დღე. ზღვაზე დასვენება',
            paragraph: 'საუზმე სასტუმროში. თავისუფალი დრო. ღამისთევა სასტუმროში.'
        },
        {
            id: 10,
            head: '10 დღე. ზღვაზე დასვენება',
            paragraph: 'საუზმე სასტუმროში. თავისუფალი დრო. ღამისთევა სასტუმროში.'
        },
        {
            id: 11,
            head: '11 დღე. ზღვაზე დასვენება',
            paragraph: 'საუზმე სასტუმროში. თავისუფალი დრო. ღამისთევა სასტუმროში.'
        },
        {
            id: 12,
            head: '12 დღე.',
            paragraph: 'საუზმე სასტუმროში. ტრანსფერი აეროპორტში.'
        }
        ],
        inPrice: [
        '3* სასტუმროში განთავსება და დილის საუზმე (დამატებითი საფასურის გადახდის შემთხვევაში შესაძლებელია ვახშმის დამატება)',
        'აეროპორტი-სასტუმრო-აეროპორტი ჯგუფური ტრანსფერი ფიუმიჩინოსა და ჩამპინოს აეროპორტების ყველა რეისისთვის',
        'ტრანსპორტირება კომფორტული ავტობუსით (ტრანსპორტის, საწვავისა და მძღოლის ხარჯები)',
        'რუსულენოვანი მეგზური მთელი ტურის განმავლობაში',
        'ექსკურსიები რუსულენოვანი ლიცენზირებული მეგზურით: რომი, ფლორენცია, ვენეცია, ვატიკანი'
        ],
        additionTours: [
        'ექსკურსია ღამის რომი - 30 ევრო',
        'ექსკურსია ნეაპოლი-პომპეი - 70 ევრო',
        'პომპეიში შესასვლელი ბილეთი - 18 ევრო',
        'ვატიკანის მუზეუმში შესასვლელი ბილეთები - 45 ევრო',
        'ექსკურსია სიენასა + სან ჯიმინიანოში - 65 ევრო',
        'ექსკურსია პიზაში - 45 ევრო',
        'ექსკურსია უფიცის გალერეაში - 29 ევრო + 26 ევრო შესასვლელი ბილეთი',
        'წმინდა მარკოზის ტაძარი - 15 ევრო',
        'წმინდა ლაზარეს კუნძული - 40 ევრო'
        ],
        mustPay: [
        'ყურსასმენები მთელი მოგზაურობის განმავლობაში 16 ევრო',
        'ვენეციაში: დიდი არხით გასეირნება - უკან ჯუდეკის არხით დაბრუნება - 30 ევრო',
        'სასტუმროს გადასახადი (City Tax), რომელსაც იხდით სასტუმროში ადგილზე:',
        'რომში სასტუმროში 3*, 4* - 3-6 ევრო კაცზე/დღეში',
        'მონტეკატინი-ტერმე 3* - 1,5 ევროდან კაცზე/დღეში',
        'ვენეტოს რეგიონში 3* - 2,4 ევროდან კაცზე/დღეში'
        ]
    }
    },
    {
    id: 4,
    head: 'იტალია-საფრანგეთი',
    img: "https://via.placeholder.com/800x500?text=Vienna+Tour",
    includes: 'მილანი - (ტბა მაჟორე) - ბოლონია - (ვენეცია) - ფლორენცია - გენუა - ნიცა - (მონტე-კარლო) - დიჟონი - პარიზი - ლუარის ციხესიმაგრეები - ბურჟი - ჟენევა - მილანი ',
    details: {
        day: [
        {
            id: 1,
            head: '1 დღე. მილანი',
            paragraph: 'ჩაფრენა მილანში. აეროპორტში კომპანიის წარმომადგენელთან შეხვედრა, რომელსაც ხელში ეჭირება წარწერა Europe Voyage. მხოლოდ ადრეული რეისით ჩაფრენილთათვის შესაძლებელია დაორგანიზდეს სურვილისამებრ ექსკურსია: მოგზაურობა მაჟორეს ტბაზე ნავით, ვიზიტი ისოლა ბელაში თავისი საოცარი ბოტანკურ ბაღით და ბორომეოს ჰერცოგის სასახლეში. ტრანსფერი და სასტუმროში  განთავსება. ღამისთევა სასტუმროში.'
        },
        {
            id: 2,
            head: '2 დღე. ბოლონია',
            paragraph: 'საუზმე სასტუმროში. გადასვლა ბოლონიაში. მიმოხილვითი ექსკურსია ბოლონიაში. თავისუფალი დღე. სასტუმროში განთავსება ბოლონიის მიმდებარე ტერიტორიაზე. ღამისთევა სასტუმროში.'
        },
        {
            id: 3,
            head: '3 დღე. ვენეცია',
            paragraph: 'საუზმე სასტუმროში. თავისუფალი დრო. სურვილისამებრ მოეწყობა ექსკურსია ვენეციაში. ვენეცია არის გამორჩეული ქალაქი თავისი სილამაზით... ღამისთევა სასტუმროში.'
        },
        {
            id: 4,
            head: '4 დღე. ფლორენცია-გენუა',
            paragraph: 'საუზმე სასტუმროში. გადასვლა ფლორენციაში... ღამისთევა სასტუმროში.'
        },
        {
            id: 5,
            head: '5 დღე. გენუა-ნიცა-(მონტე-კარლო)',
            paragraph: 'საუზმე სასტუმროში. გადასვლა ნიცაში... ღამისთევა ნიცას სასტუმროში.'
        },
        {
            id: 6,
            head: '6 დღე. დიჟონი',
            paragraph: 'საუზმე სასტუმროში. გადასვლა დიჟონში... ღამისთევა სასტუმროში.'
        },
        {
            id: 7,
            head: '7 დღე. პარიზი',
            paragraph: 'საუზმე სასტუმროში. გადასვლა პარიზში... ღამისთევა სასტუმროში.'
        },
        {
            id: 8,
            head: '8 დღე. პარიზი',
            paragraph: 'საუზმე სასტუმროში. თავისუფალი დღე... ღამისთევა სასტუმროში.'
        },
        {
            id: 9,
            head: '9 დღე. ლუარ-ბურჟის ციხესიმაგრეები',
            paragraph: 'საუზმე სასტუმროში. გამგზავრება ლუარის ხეობაში... ღამისთევა სასტუმროში.'
        },
        {
            id: 10,
            head: '10 დღე. ჟენევა (შვეიცარია)',
            paragraph: 'საუზმე სასტუმროში. გადასვლა ჟენევაში... ღამისთევა სასტუმროში.'
        },
        {
            id: 11,
            head: '11 დღე. მილანი',
            paragraph: 'საუზმე სასტუმროში. გადასვლა მილანში... ღამისთევა სასტუმროში.'
        },
        {
            id: 12,
            head: '12 დღე. მილანი',
            paragraph: 'საუზმე სასტუმროში. ტრანსფერი აეროპორტში.'
        }
        ],
        inPrice: [
        '3* სასტუმროში განთავსება (დილის საუზმე)',
        'ჯგუფური ტრანსფერი აეროპორტი-სასტუმრო-აეროპორტი (მალპენსას ყველა რეისისათვის)',
        'ტრასნსპორტირებით უზრუნველყოფა რუსულენოვან მეგზურთან ერთად',
        'ექსკურსიები რუსულენოვან მეგზურით: მილანი, ბოლონია, ფლორენცია და პარიზი',
        'გასეირნება მეგზურთან ერთად გენუასა და დიჟონში'
        ],
        additionTours: [
        'ტბა მაჟორე - 60 ევრო (ნავი შედის საფასურში)',
        'სასახლეში და ბოტანიკურ ბაღში შესასვლელი ბილეთი „ისოლა ბელა“ - 25 ევრო',
        'ვენეციაში ექსკურსია - 65 ევრო',
        'ექსკურსია მონტე-კარლოში - 70 ევრო',
        'ექსკურსია ნოტრ დამში და ლათინურ კვარტალში - 40 ევრო',
        'ექსკურსია ვერსალში - 60 ევრო + 23 ევრო ბილეთი',
        'ექსკურსია მონმარტში - 40 ევრო',
        'ექსკურსია ლუვრში მეგზურთან ერთად 50 ევრო + ბილეთი 25 ევრო',
        'ღამის პარიზი - 40 ევრო',
        'ნავით გასეირნება სენაზე პარიზში - 20 ევრო',
        'მულენ რუჟის შოუ (ფასი ინდივიდუალურად)',
        'ლუარის ციხესიმაგრეები: შამბორი - 21 ევრო, შენონსო - 20 ევრო'
        ],
        mustPay: [
        'ყურსასმენები მთელი მოგზაურობის განმავლობაში - 20 ევრო',
        'სასტუმროს გადასახადი (City Tax)',
        'ვენეციაში დიდი არხით გასეირნება - უკან ჯუდეკას არხით დაბრუნება - 25 ევრო'
        ]
    }
    },
    {
    id: 5,
    head: 'იტალია - შვეიცარია - ლიხტენშტეინის სამეფო',
    img: "https://via.placeholder.com/800x500?text=Vienna+Tour",
    includes: 'მილანი - (ტბა მაჟორე) - (ვერონა) - ლიხტენშტეინის სამეფო - ციურიხი - (ლუცერნი) - (შტაიმ ამ რაინის ჩანჩქერი) - ბერნი - ტურინი-მილანი ',
    details: {
        day: [
        {
            id: 1,
            head: '1 დღე.',
            paragraph: 'მილანში ჩაფრენა. აეროპორტში პარტნიორი კომპანიის წარმომადგენელთან შეხვედრა, რომელსაც ხელში ეჭირება წარწერა  - „Europe Voyage”. ტრანსფერი და სასტუმროში განთავსება. თავისუფალი დრო. ღამისთევა სასტუმროში.'
        },
        {
            id: 2,
            head: '2 დღე.',
            paragraph: 'საუზმე სასტუმროში. თავისუფალი დრო. ღამისთევა სასტუმროში.'
        },
        {
            id: 3,
            head: '3 დღე. მილანი.',
            paragraph: 'საუზმე სასტუმროში. შეხვედრა ჯგუფის მეგზურთან. მიმოხილვითი საფეხმავლო ექსკურსია მილანში რუსულენოვან მეგზურთან ერთად, რომელიც მოიცავს ქალაქის ცენტრალური ნაწილის გაცნობას, შუასაუკუნოვანი ციხე-სიმაგრე „სფორცის’’ მონახულებას...'
        },
        {
            id: 4,
            head: '4 დღე. მილანი - (ვერონა)',
            paragraph: 'საუზმე სასტუმროში. თავისუფალი დრო. მსურველთათვის მოეწყობა ექსკურსია ვერონაში...'
        },
        {
            id: 5,
            head: '5 დღე.ლიხტენშტეინი-ციურიხი',
            paragraph: 'საუზმე სასტუმროში. სასტუმროდან გამოსვლა (ბარგით). გადასვლა ციურიხში...'
        },
        {
            id: 6,
            head: '6 დღე. (რეინის ჩანჩქერი - შტაიმ ამ რაინი -ლუცერნი)',
            paragraph: 'საუზმე სასტუმროში. თავისუფალ დროს მსურველთათვის დაიგეგმება ექსკურსია რეინის ჩანჩქრეზე...'
        },
        {
            id: 7,
            head: '7 დღე. ბერნი',
            paragraph: 'საუზმე სასტუმროში. სასტუმროდან გამოსვლა (ბარგით). გადასვლა შვეიცარიის დედაქალაქ ბერნში...'
        },
        {
            id: 8,
            head: '8 დღე. მილანი',
            paragraph: 'საუზმე სასტუმროში. გადასვლა ტურინის ცენტრში. ტურინი არის 20 ოლიმპიური თამაშის ცენტრი...'
        },
        ],
        inPrice: [
        '3* - 4* სასტუმროში განთავსება და დილის საუზმე',
        'აეროპორტი-სასტუმრო-აეროპორტი ჯგუფური ტრანსფერი მალპენსას აეროპორტის ყველა რეისისთვის',
        'ტრანსპორტით უზრუნველყოფა რუსულენოვანი ასისტენტის თანხლებით',
        'ექსკურსიები რუსულენოვანი ლიცენზირებული მეგზურით: მილანი, ციურიხი.',
        'ტურინი, ბერნი, ლიხტენშტეინის მონახულება რუსულენოვანი ასისტენტის თანხლებით.'
        ],
        additionTours: [
        'ლა-სკალას თეატრი - 30 ევრო (ღირებულებაში შედის შესასვლელი ბილეთის საფასური)',
        'ექსკურსია მილანში არსებულ დოუმოს საკათედრო ტაძარში - 25 ევრო',
        'მაჟორის ტბაზე გასეირნება - 55 ევრო ( ღირებულებაში შედის კატერით მგზავრობის საფასური)',
        'სასახლეს და ბოტანიკურ ბაღში შესასვლელი ბილეთი - 17 ევრო (იზოლა ბელა)',
        'ექსკურსია ვერონაში - 60 ევრო',
        'გარდას ტბის მონახულება - 10 ევრო',
        'ჩანჩქერის და შტაინ ამ რაინის დათვალიერება - 65 ევრო',
        'ექსკურსია ლუცერნში - 65 ევრო',
        'ქალაქ მონტრეს მონახულება - 10 ევრო',
        'ქალაქ გრიუერში სტუმრობა - 10 ევრო',
        'ექსკურსია ტურინში ლიცენზირებულ მეგზურთან ერთად - 10 ევრო',
        'ექსკურსია სამეფო სასახლეში - 35 ევრო (ღირებულებაში შედის შესასვლელი ბილეთის საფასური)'
        ],
        mustPay: [
        'გადასახადი სასტუმროებში (City Tax)',
        'ყურსასმენებით სარგებლობა მთელი კვირის განმავლობაში - 16 ევრო'
        ]
    }
    },
    {
    id: 6,
    head: 'კლასიკური იტალია',
    img: "https://via.placeholder.com/800x500?text=Vienna+Tour",
    includes: 'რომი - (ნეაპოლი, პომპეი) - (პიზა) - მონტეკატინი-ტერმე - (სიენა- სან-ჯიმინიანო) - ფლორენცია - ვენეტოს რეგიონი - ვენეცია - რომი',
    details: {
        day: [
        {
            id: 1,
            head: '1 დღე.',
            paragraph: 'ჩაფრენა რომში. აეროპორტში კომპანიის წარმომადგენელთან შეხვედრა, რომელსაც ხელში ეჭირება წარწერა Europe Voyage... ღამისთევა რომის სასტუმროში.'
        },
        {
            id: 2,
            head: '2 დღე. რომი (ნეაპოლი-პომპეი)',
            paragraph: 'საუზმე სასტუმროში. სურვილისამებრ ჩატარდება დამატებითი ექსკურსია ნეაპოლი-პომპეი (სრული დღე)... დაბრუნება და ღამისთევა რომში.'
        },
        {
            id: 3,
            head: '3 დღე. რომი - პიზა',
            paragraph: 'საუზმე სასტუმროში. ვატიკანის მუზეუმის ტური რუსულენოვანი მეგზურით... ღამისთევა სასტუმროში მონტეკატინი-ტერმეს ტერიტორიაზე.'
        },
        {
            id: 4,
            head: '4 დღე. ფლორენცია (სიენა - სან ჯიმინიანო)',
            paragraph: 'საუზმე სასტუმროში. თავისუფალი დრო ან სურვილისამებრ ექსკურსია სიენასა და სან ჯიმინიანოში... ღამისთევა სასტუმროში.'
        },
        {
            id: 5,
            head: '5 დღე. ფლორენცია - ვენეტოს რეგიონი',
            paragraph: 'საუზმე სასტუმროში. გამგზავრება ფლორენციაში. ფლორენციის ისტორიული ცენტრის ტური... ღამისთევა ვენეტოს რეგიონში.'
        },
        {
            id: 6,
            head: '6 დღე. ვენეცია',
            paragraph: 'საუზმე სასტუმროში. გამგზავრება ვენეციაში — მსოფლიოს ერთ-ერთი ულამაზესი ქალაქი... ღამისთევა ვენეციის ან რომის სასტუმროში.'
        },
        {
            id: 7,
            head: '7 დღე. რომი',
            paragraph: 'საუზმე სასტუმროში. გამგზავრება რომში. ღამისთევა რომში.'
        },
        {
            id: 8,
            head: '8 დღე. რომი',
            paragraph: 'საუზმე სასტუმროში. გამგზავრება რომის აეროპორტში (ტრანსფერი).'
        },
        ],
        inPrice: [
        '3* სასტუმროში განთავსება და დილის საუზმე (დამატებითი საფასურის გადახდის შემთხვევაში შესაძლებელია ვახშმის დამატება)',
        'აეროპორტი-სასტუმრო-აეროპორტი ჯგუფური ტრანსფერი ფიუმიჩინოსა და ჩამპინოს აეროპორტების ყველა რეისისთვის',
        'ტრანსპორტირება კომფორტული ავტობუსით (ტრანსპორტის, საწვავისა და მძღოლის ხარჯები)',
        'რუსულენოვანი მეგზური მთელი ტურის განმავლობაში',
        'ექსკურსიები რუსულენოვანი ლიცენზირებული მეგზურით: რომი, ფლორენცია, ვენეცია, ვატიკანი'
        ],
        additionTours: [
        'ექსკურსია ღამის რომი - 30 ევრო',
        'ექსკურსია ნეაპოლი-პომპეი - 70 ევრო',
        'პომპეიში შესასვლელი ბილეთი - 18 ევრო',
        'ვატიკანის მუზეუმში შესასვლელი ბილეთები - 45 ევრო (მოიცავს ურიგოდ შესვლას, ყურსასმენებს, სიქსტეს კაპელასა და წმინდა პეტრეს ტაძრის მონახულებას)',
        'ექსკურსია სიენასა + სან ჯიმინიანოში - 65 ევრო',
        'ექსკურსია პიზაში - 45 ევრო',
        'ექსკურსია უფიცის გალერეაში - 29 ევრო + 26 ევრო შესასვლელი ბილეთი',
        'წმინდა მარკოზის ტაძარი - 15 ევრო',
        'წმინდა ლაზარეს კუნძული - 40 ევრო',
        'ფეხის ქირა მძღოლისა და ასისტენტისთვის'
        ],
        mustPay: [
        'ყურსასმენები მთელი მოგზაურობის განმავლობაში - 16 ევრო',
        'ვენეციაში: დიდი არხით გასეირნება - უკან ჯუდეკის არხით დაბრუნება - 30 ევრო',
        'სასტუმროს გადასახადი (City Tax), რომელსაც იხდით სასტუმროში ადგილზე:',
        'რომში სასტუმროში 3*, 4* - 3-6 ევრო კაცზე/დღეში',
        'მონტეკატინი-ტერმე 3* - 1,5 ევროდან კაცზე/დღეში',
        'ვენეტოს რეგიონში 3* - 2,4 ევროდან კაცზე/დღეში'
        ]
    }
    },
    {
    id: 7,
    head: 'საფრანგეთი-ბელგია-ჰოლანდია',
    img: "https://via.placeholder.com/800x500?text=Vienna+Tour",
    includes: 'პარიზი - ჟივერნი - რუანი - (ეტრეტა) - ბრიუგე - ბრიუსელი - ამსტერდამი - (ვოლენდამი - ზაანს შანსი) - ანტვერპენი - პარიზი - (ვერსალი)',
    details: {
        day: [
        {
            id: 1,
            head: '1 დღე.',
            paragraph: 'ჩაფრენა პარიზში. აეროპორტში კომპანიის წარმომადგენელთან შეხვედრა, რომელსაც ხელში ეჭირება წარწერა Europe Voyage. ტრანსფერი და განთავსება სასტუმროში. თავისუფალი დრო. სურვილისამებრ შესაძლებელია ღამის პარიზის ტურის მოწყობა. ღამისთევა პარიზის სასტუმროში.'
        },
        {
            id: 2,
            head: '2 დღე. პარიზი-ჟივერნი-(ეტრეტა)-რუანი',
            paragraph: 'საუზმე სასტუმროში. ჟივერნი-ში გადასვლა. პატარა თვალწარმტაცი სოფელი სენის დაქანებულ ნაპირებზე, სადაც მხოლოდ 540 ადამიანი ცხოვრობს. კლოდ მონემ აქ გაატარა ცხოვრების მეორე ნახევარი. გადაადგილება რუანში. სურვილისამებრ ვიზიტი ეთრეტაში. სასტუმროში განთავსება და ღამისთევა.'
        },
        {
            id: 3,
            head: '3 დღე. ბრიუგე-ბრიუსელი.',
            paragraph: 'საუზმე სასტუმროში. ბრიუგეში გადასვლა, ქალაქის ტური. ბრიუსელში გადასვლა, ქალაქის ტური. სასტუმროში განთავსება. ღამისთევა ბრიუსელის სასტუმროში.'
        },
        {
            id: 4,
            head: '4 დღე. ამსტერდამი',
            paragraph: 'საუზმე სასტუმროში. ამსტერდამში გადასვლა. არხების დათვალიერება (სურვილისამებრ ნავებით გასეირნება). სასტუმროში განთავსება. თავისუფალი დრო. ღამისთევა სასტუმროში.'
        },
        {
            id: 5,
            head: '5 დღე. ვოლენდამი-ზაანს შანსი-ანტვერპენი',
            paragraph: 'საუზმე სასტუმროში. სურვილისამებრ ექსკურსია ვოლენდამსა და ზაანს შანსში. ხუთი ქარის წისქვილი, ეთნოგრაფიული მუზეუმი, ისტორიული შენობები. ანტვერპენში ქალაქის ტური. სასტუმროში განთავსება. ღამისთევა.'
        },
        {
            id: 6,
            head: '6 დღე. პარიზი',
            paragraph: 'საუზმე სასტუმროში. პარიზში დაბრუნება. სურვილისამებრ ექსკურსია ლუვრში, პარიზის ღვთისმშობლის ტაძარში, ლათინურ კვარტალში. სასტუმროში განთავსება. ღამისთევა.'
        },
        {
            id: 7,
            head: '7 დღე. პარიზი',
            paragraph: 'საუზმე სასტუმროში. თავისუფალი დღე. ღამისთევა სასტუმროში.'
        },
        {
            id: 8,
            head: '8 დღე. პარიზი',
            paragraph: 'საუზმე სასტუმროში. დამატებითი ექსკურსია მონმარტზე. აეროპორტში ტრანსფერი.'
        }
        ],
        inPrice: [
        '3* სასტუმროში განთავსება და დილის საუზმე',
        'აეროპორტი-სასტუმრო-აეროპორტი ჯგუფური ტრანსფერი: ფრენების მიხედვით (დეტალები აღწერილობაში)',
        'ტრანსპორტირება კომფორტული ავტობუსით (ტრანსპორტის, საწვავისა და მძღოლის ხარჯები)',
        'რუსულენოვანი მეგზური მთელი ტურის განმავლობაში',
        'ექსკურსიები რუსულენოვანი ლიცენზირებული მეგზურით: პარიზი, ბრიუგე, ბრიუსელი, ამსტერდამი',
        'რუსულენოვან ასისტენტთან ერთად ვიზიტი ჟივერნიში, რუანში, ანტვერპენში'
        ],
        additionTours: [
        'მუზეუმების ბილეთები',
        'ექსკურსია ვერსალში 57 ევრო + 18 შესასვლელი ბილეთი',
        'ექსკურსია პარიზის ღვთისმშობლის ტაძარში 35 ევრო',
        'ექსკურსია მონმარტზე 35 ევრო',
        'ვახშამი და საღამოს შოუები მულენ რუჟის კაბარეში (ფასი პროგრამის მიხედვით)',
        'სენაზე ნავის ბილეთი 15 ევრო',
        'ექსკურსია ღამე პარიზში 30 ევრო',
        'ლუვრის მუზეუმი გიდით 50 € + შესვლის ბილეთი 20 €',
        'ეტრეტას ექსკურსია 20 ევრო',
        'ექსკურსია ვოლენდამში + ზაანს შანსში 65 ევრო'
        ],
        mustPay: [
        'ყურსასმენები მთელი მოგზაურობის განმავლობაში - 20 ევრო',
        'ნავით გასეირნება ამსტერდამში 10 ევრო',
        'გადასახადი სასტუმროებში (City Tax) 1-დან 5 ევრომდე დღეში ერთ ადამიანზე',
        'ამსტერდამში შესვლის გადასახადი 1,5 ევროდან ერთ ადამიანზე'
        ]
    }
    }

]

async function seedDB() {
  try {
    await Tour.deleteMany(); // ძველი წაშალე
    await Tour.insertMany(tours); // ახალი ჩასვი
    console.log("✅ Tours added successfully!");
  } catch (err) {
    console.log(err);
  } finally {
    mongoose.connection.close();
  }
}

seedDB();
